{
  "backend/main.mo": "Motoko canister implementing user profiles with access control plus predefined brand, appliance, and product maps.",
  "feature_evidence.json": "Feature evidence report listing feature metadata, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short functional descriptions for documentation.",
  "frontend/.env.example": "Example environment config showing required and optional Vite variables for sitemap and verification.",
  "frontend/index.css": "Tailwind CSS base/theme file defining OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "Main HTML entry with updated favicon links, metadata, and injected Google verification script.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and declaring sitemap location.",
  "frontend/public/sitemap.template.xml": "Sitemap template containing SITE_URL placeholder for build-time replacement.",
  "frontend/public/sitemap.xml": "Current sitemap file still containing unreplaced SITE_URL placeholder.",
  "frontend/scripts/generate-sitemap.mjs": "Node script generating sitemap.xml from template using VITE_SITE_URL with validation.",
  "frontend/src/App.tsx": "Main React app showing header with updated v4 logo, contact info, service cards, and booking dialog logic.",
  "frontend/src/components/BookServiceDialog.tsx": "A form dialog for submitting service requests with validation, state handling, and mutation submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useApplianceBrandMap.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useCreateServiceRequest.ts": "Mutation hook that sends new service requests to the backend and invalidates the service requests query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, identity persistence, and related state.",
  "frontend/src/hooks/useQueries.ts": "Query hooks to fetch appliances, brands, and brands filtered by appliance using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base configuration defining theme variables, dark mode values, and global styles.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including persistence across navigation.",
  "frontend/src/vite-env.d.ts": "Type definitions for Vite environment variables.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, styles, animations, and enabling plugins.",
  "project_state.json": "Describes the current state and requirements for a VS Appliances service website, including removing brand selection, fixing logo assets, enabling SEO files, and supporting admin management features. Lists known issues, image requirements, and existing feature definitions."
}