{
  "backend/main.mo": "Defines Brand, Appliance, and Product types, seeds in‑memory Maps with sample data, and exposes a query to fetch brands for a given appliance.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Tailwind CSS theme file defining color tokens and light/dark mode variables for the app UI.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main UI displaying service icons and showing a dialog with brands filtered by selected appliance.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor, updating on identity changes.",
  "frontend/src/hooks/useApplianceBrandMap.ts": "Builds a mapping of appliance names to their brands and provides a helper to retrieve brands per appliance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching appliances, brands, and per‑appliance brands from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and a full set of light/dark OKLCH CSS variables plus global border and body styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context and imports global styles.",
  "frontend/src/vite-env.d.ts": "Declares Vite environment variable types for Internet Identity and backend config.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, radii, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, features, and known issues related to the VS Appliances service website."
}