{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and static brand, appliance, and product data using Maps.",
  "feature_evidence.json": "Feature evidence record describing required static image files for service cards and related components.",
  "frontend-file-summaries.txt": "List of frontend file paths mapped to short textual summaries of each file’s purpose.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting favicon, page metadata, and loading the React app.",
  "frontend/src/App.tsx": "Main React UI showing header, service cards with generated image assets, and booking dialog handling.",
  "frontend/src/components/BookServiceDialog.tsx": "Service booking dialog with form validation, submission via useCreateServiceRequest, and success handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages authenticated or anonymous backend actors and refreshes queries on identity changes.",
  "frontend/src/hooks/useApplianceBrandMap.ts": "Empty placeholder file intended for a hook mapping appliances to brands.",
  "frontend/src/hooks/useCreateServiceRequest.ts": "React Query mutation hook that submits service requests through the backend actor and invalidates admin queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state using AuthClient, including loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch appliances, brands, and brands by appliance using an actor from canister backend.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables, including light/dark mode color tokens and global background/foreground settings.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/src/vite-env.d.ts": "Adds type definitions for Vite environment variables used in the project.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, radius, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, deployed version info, feature requirements, and needed image assets for the site."
}