{
  "backend/main.mo": "Motoko canister defining user profile authorization plus in‑memory maps for brands, appliances, and products with sample seeded data.",
  "feature_evidence.json": "Feature evidence report describing required icon replacements and asset additions for the React frontend.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including config, hooks, components, and styling.",
  "frontend/index.css": "Tailwind base setup with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point linking favicon and loading the React app root and main script.",
  "frontend/src/App.tsx": "Main UI showing service cards, header with static image icons, and triggers for the booking dialog.",
  "frontend/src/components/BookServiceDialog.tsx": "Service booking dialog handling form state, validation, and submission via createServiceRequest.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useApplianceBrandMap.ts": "Empty file placeholder for appliance‑brand mapping hook.",
  "frontend/src/hooks/useCreateServiceRequest.ts": "React Query mutation hook that submits a service request through the backend actor and invalidates related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, loading saved identities, and exposing login state helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that fetch appliances, brands, and appliance-specific brands using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with extensive CSS variables for theme colors, dark mode, and global styling.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility methods for reading, persisting, and clearing URL parameters and session-stored parameters.",
  "frontend/src/vite-env.d.ts": "Defines TypeScript types for Vite environment variables.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors from CSS variables, extended theme options, and plugins.",
  "project_state.json": "Describes the project's state, versions, required features, and pending requests including icon replacement and Google indexing."
}