{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Complaint flow: filter brand list by selected appliance",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Filter the brand-selection step so only brands for the selected appliance are displayed, with all user-facing text in English.",
      "acceptanceCriteria": [
        "When the user selects the AC icon, only AC brands are shown.",
        "When the user selects the Washing Machine icon, only washing machine brands are shown.",
        "When the user selects the Refrigerator icon, only refrigerator brands are shown.",
        "When the user selects the Electrical Service icon, only electrical-related brands (or an appropriate brand list) are shown.",
        "No page in the brand-selection step displays a combined/all-brands list unless an explicit 'All brands' option is intentionally selected by the user (do not add such an option unless it already exists)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the appliance icon/service selection UI to track a selected appliance key and render a brand list derived only from that selection. Ensure the brand list never falls back to showing all brands when an appliance is selected. Keep all user-facing labels/messages in English."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/replace stub queries with React Query hooks needed by the appliance→brand selection UI (e.g., loading appliances and the selected appliance’s brands) so the UI can display only the correct per-appliance brand list."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Create a single, maintainable brands-per-appliance mapping keyed by appliance, and make the brand-selection UI derive its list strictly from the selected key (including a clear empty state).",
      "acceptanceCriteria": [
        "There is a single source of truth for brands-per-appliance (not duplicated across multiple UI components).",
        "The brand-selection UI receives the selected appliance key and uses it to fetch/compute the brand list shown.",
        "If the selected appliance has no configured brands, the UI shows a clear English empty-state message (e.g., 'No brands available for this appliance yet.') and does not fall back to showing all brands."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useApplianceBrandMap.ts",
          "operation": "create",
          "description": "Create a dedicated hook/module that builds and exposes a single source-of-truth mapping of applianceKey → brands[] (derived from backend-provided appliance/brand data). This module should also provide a helper to return the selected appliance’s brands (or an empty list) strictly by appliance key."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the brand-selection rendering to depend exclusively on the mapping/hook keyed by the selected appliance. Add an English empty-state message (e.g., 'No brands available for this appliance yet.') when the selected appliance has no configured brands, without falling back to an all-brands list."
        }
      ]
    }
  ]
}