{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace service card icons with static image assets for four services",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Render static <img> assets (not icon components) for AC, Washing Machine, Refrigerator, and Electrical service cards with English alt text",
      "acceptanceCriteria": [
        "In the Services section (frontend/src/App.tsx), each of the four service cards displays an <img> (not a React icon component) for AC, Washing Machine, Refrigerator, and Electrical.",
        "Each of the four service images has an English alt attribute describing the service (e.g., \"AC Service\", \"Washing Machine\", \"Refrigerator\", \"Electrical Service\").",
        "No lucide-react (or other icon library) components are used for these four service card visuals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Services grid uses only static image sources for the four service cards and renders them via <img>; make alt text explicit and English for each service (AC Service, Washing Machine, Refrigerator, Electrical Service), and confirm no icon components are used for these visuals."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add required static image files for the four service cards under frontend/public/assets/generated with exact filenames",
      "acceptanceCriteria": [
        "The following files exist in frontend/public/assets/generated and can be loaded directly via the browser at /assets/generated/: ac-icon.dim_256x256.png, washing-machine-icon.dim_256x256.png, refrigerator-icon.dim_256x256.png, electrical-icon.dim_256x256.png.",
        "The four service card images render correctly in the Services grid without broken image links in both desktop and mobile layouts."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ac-icon.dim_256x256.png",
          "operation": "create",
          "description": "Add the static AC service image asset at this exact path and filename so it loads at runtime from /assets/generated/."
        },
        {
          "path": "frontend/public/assets/generated/washing-machine-icon.dim_256x256.png",
          "operation": "create",
          "description": "Add the static Washing Machine service image asset at this exact path and filename so it loads at runtime from /assets/generated/."
        },
        {
          "path": "frontend/public/assets/generated/refrigerator-icon.dim_256x256.png",
          "operation": "create",
          "description": "Add the static Refrigerator service image asset at this exact path and filename so it loads at runtime from /assets/generated/."
        },
        {
          "path": "frontend/public/assets/generated/electrical-icon.dim_256x256.png",
          "operation": "create",
          "description": "Add the static Electrical service image asset at this exact path and filename so it loads at runtime from /assets/generated/."
        }
      ]
    }
  ]
}